Repository: ThorsAngerVaNeT/project-management-app
Catalog: src/i18n/messages.*.xlf
Languages: ru

# LoginModalTitle
source: Login
ru: Вход

# loginPlaceholder
source: Login
ru: Логин

# loginRequiredErrorTip
source: Please provide a login
ru: Пожалуйста укажите логин

# loginMinlengthErrorTip
source: Login should be at least two characters long
ru: Логин должен содержать как минимум два символа

# passwordPlaceholder
source: Password
ru: Пароль

# passwordRequiredErrorTip
source: Please provide a password
ru: Пожалуйста введите пароль

# passwordPatternErrorTip
source: Please check your password for typos
ru: Пожалуйста проверьте правильность ввода пароля

# LogInButton
source: Log In
ru: Войти

# passwordRequirements
source: <p>Please provide login (more than two characters), name and a strong password.</p><p>For your safety password should be:</p><ul><li>at least 8 characters</li><li>both uppercase and lowercase letters</li><li>both letters and numbers</li><li>contain at least one special character, e.g., ! @ # ? ]</li></ul>
ru: Пожалуйста введите логин и пароль. Надежный пароль должен: состоять минимум из 8 символов, включать заглавные, строчные буквы и цифры, а также содержать как минимум один специальный символ (! @ # ? ] и т.д.)

# userAlreadyExistsErrorTip
source: This user login already exists, please provide a new one
ru: Пользователь с таким логином уже существует, пожалуйста придумай новый логин

# namePlaceholder
source: Name
ru: Имя

# nameRequiredErrorTip
source: Please provide a name
ru: Пожалуйста укажите имя

# deleteUserText
source: Delete your user account
ru: Удалить ваш аккаунт

# deleteUserButton
source: Delete Forever
ru: Удалить навсегда

# itemToDeleteYourAccount
source: your account
ru: ваш аккаунт

# CreateBoardTitle
source: Title
ru: Заголовок

# CreateBoardTitleRequiredErrorTip
source: Please provide a title
ru: Пожалуйста введите заголовок

# CreateBoardTitleMinlengthErrorTip
source: Title should be 2-40 characters long
ru: Заголовок должен содержать от 2 до 40 символов

# CreateBoardParticipants
source: Participants
ru: Участники

# CreateBoardTeamMembers
source: Please select team members
ru: Пожалуйста выберите участников

# CreateBoardImageTooltip
source: What do you want to see on board cover
ru: Выберите обложку для вашей доски

# CreateBoardCancelText
source: Cancel
ru: Отмена

# CreateBoardOkText
source: Save
ru: Сохранить

# OpenBoard
source: Open the Board
ru: Открыть доску

# EditBoard
source: Edit the Board
ru: Редактировать доску

# DeleteBoard
source: Delete the Board
ru: Удалить доску

source: Access Denied
ru: Доступ запрещен

# EditBoardModalTitle
source: Edit Board
ru: Редактировать доску

# itemToDeleteThisBoard
source: this board
ru: эту доску

# AccessDeniedModalTitle
source: Access Denied
ru: Доступ запрещен

# AccessDeniedModalContent
source: Sorry, but you're not a participant of this board. Please contact the owner to get access!
ru: К сожалению вы не являетесь участником этой доски. Пожалуйста свяжитесь с владельцем для получения доступа

source: Add New Column
ru: Дообавить новый столбец

# CreateColumnModalTitle
source: Create Column
ru: Создать столбец

source: Add New Board
ru: Добавить новую доску

# CreateBoardModalTitle
source: Create Board
ru: Создать доску

source: Column Title
ru: Заголовок столбца

# CreateColumnTitleRequiredErrorTip
source: Please provide a title
ru: Пожалуйста укажите заголовок

# CreateColumnTitleMaxlengthErrorTip
source: Title should be 1-20 characters long
ru: Заголовок должен содержать от 1 до 20 символов

# CancelButtonText
source: Cancel
ru: Отмена

# SaveButtonText
source: Save
ru: Сохранить

# EditColumnTitleTooltip
source: Edit column title
ru: Редактировать заголовок столбца

# DeleteColumnTooltip
source: Delete column
ru: Удалить столбец

# SaveButtonTooltip
source: Save
ru: Сохранить

# CancelButtonTooltip
source: Cancel
ru: Отмена

source: Add New Task
ru: Добавить новую задачу

# itemToDeleteThisColumn
source: this column
ru: этот столбец

# CreateTaskModalTitle
source: Create Task
ru: Создать задачу

# CheckpointTitleInputPlaceholder
source: Checkpoint Title
ru: Заголовок чек-поинта

# CreatePointTitleRequiredErrorTip
source: Please provide a title
ru: Пожалуйста укажите заголовок

# CreatePointTitleMinlengthErrorTip
source: Title should be 1-255 characters long
ru: Заголовок должен содержать от 1 до 255 символов

# CheckPointTooltip
source: Check/Uncheck checkpoint
ru: Отметить "Выполнено/Не выполнено"

# EditPointTooltip
source: Edit checkpoint
ru: Редактировать чек-поинт

# DeletePointTooltip
source: Delete checkpoint
ru: Удалить чек-поинт

# confirmationTitle
source: Are you sure?
ru: Вы уверены?

# confirmationText
source: Are you sure you want to delete {{ itemToDelete }}?
ru: Вы уверены, что хотите удалить ?

source: Edit Profile
ru: Редактировать профиль

source: Log Out
ru: Выйти

# SignUpModalTitle
source: Sign Up
ru: Зарегистрироваться

# EditProfileModalTitle
source: Edit Profile
ru: Редактировать профиль

# EditProfileSaveButton
source: Save
ru: Сохранить

# SearchInputPlaceholder
source: Search
ru: Поиск

# inputSearchLabel
source: search result:
ru: результаты поика:

# SearchByIdsLabel
source: by task number
ru: по номеру задачи

# SearchByKeyWordsLabel
source: by key words
ru: по ключевому слову

# TaskTitle
source: Title
ru: Заголовок

# TaskTitleRequiredErrorTip
source: Please provide a title
ru: Пожалуйста укажите заголовок

# TaskTitleMinlengthErrorTip
source: Title should be 2-40 characters long
ru: Заголовок должен содержать от 2 до 40 символов

# TaskDescription
source: Description
ru: Описание

# TaskDescriptionRequiredErrorTip
source: Please provide a description
ru: Пожалуйста укажите описание

# TaskDescriptionMaxlengthErrorTip
source: Description should be no more than 255 characters long
ru: Описание должно содержать не более 255 символов

# TaskResponsible
source: Responsible
ru: Ответственный

# CreateTaskResponsiblePlaceHolder
source: Please select a responsible person
ru: Пожалуйста укажите ответственного

# TaskResponsibleRequiredErrorTip
source: Please provide a responsible (task owner)
ru: Пожалуйста укажите ответственного (владельца задачи)

# CreateTaskParticipants
source: Participants
ru: Участники

# CreateTaskParticipantsPlaceHolder
source: Please select team members
ru: Пожалуйста выберите участников

# TaskParticipantsRequiredErrorTip
source: Please provide the participants
ru: Пожалуйста укажите участников

# CreateTaskChecklist
source: Task Checklist
ru: Чек-лист

# CreateTaskCancelText
source: Cancel
ru: Отмена

# CreateTaskOkText
source: Save
ru: Сохранить

# EditTaskTooltip
source: Edit task
ru: Редактировать задачу

# DeleteTaskTooltip
source: Delete task
ru: Удалить задачу

# EditTaskModalTitle
source: Edit Task
ru: Редактировать задачу

# itemToDeleteThisTask
source: 'this task
ru: эту задачу
